[
  {
    "image": "https://play-lh.googleusercontent.com/BbfjA9RAs9RjqdhhICjFTh-AKQl04ZalcDqmlMXLCRJOtiufp_-0JI1Ah3astkABkQM=w480-h960-rw",
    "title": "ChatMaster AI",
    "companyName": "TechNova Labs",
    "id": 1,
    "description": "ChatMaster AI — your ultimate AI assistant for smart conversations anytime, anywhere. Get instant answers, write better, and learn faster with ChatMaster AI’s advanced intelligence. Powered by next-gen AI — ChatMaster AI helps you think, create, and solve problems easily. Write essays, captions, stories, or emails in seconds — ChatMaster AI does it all. Boost your productivity with quick, accurate, and human-like responses. ChatMaster AI speaks your language — literally! Chat fluently in multiple languages. Perfect for students, creators, and professionals — your all-in-one AI companion. Ask anything — ChatMaster AI is always ready with helpful, creative, or funny answers. Learn new skills, explore ideas, and expand your knowledge through smart chats. Simplify your daily life with AI-powered writing, learning, and planning tools. Get summaries of books, notes for study, or explanations for complex topics in seconds. Create content, generate quotes, or craft social media posts effortlessly. Experience smooth, natural conversations powered by intelligent technology. Your data stays private — ChatMaster AI values your trust and security. A lightweight, fast, and beautiful app designed for your comfort. Chat smarter, work faster, and think bigger — with ChatMaster AI. Discover the power of conversation-driven intelligence with ChatMaster AI. Turn ideas into actions instantly using the creativity of ChatMaster AI. Master communication, productivity, and learning with one powerful AI. ChatMaster AI — the smartest way to chat, create, and grow every day."
,
    "size": 45,
    "reviews": 12500,
    "ratingAvg": 4.6,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 450 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 950 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 8700 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/Yu8NSIupn1KINmCM8ublKONAg7dnhU1FN2I2D61z4tnznql9vz9lXmG0eh43un6eAg=w480-h960-rw",
    "title": "PhotoTune Pro",
    "companyName": "PixArt Studio",
    "id": 2,
    "description": "PhotoTune Pro is the ultimate photo editing app that brings your images to life with professional-quality tools. Enhance your photos with easy-to-use filters, adjust brightness, contrast, and saturation to perfection. Apply artistic effects, overlays, and textures to make your images stand out. Crop, rotate, and resize images effortlessly to fit any platform. Remove unwanted objects or blemishes with intelligent editing features. Create stunning collages and combine multiple photos creatively. Add text, stickers, and emojis to personalize your pictures. Adjust colors, tones, and highlights for a cinematic look. Use advanced AI tools to automatically enhance portraits and landscapes. Sharpen details and reduce noise for crystal-clear images. Save your edits in high resolution and share instantly on social media. Explore creative templates and professional presets for quick edits. Transform ordinary photos into works of art with just a few taps. Easily manage your photo library and keep your projects organized. Enjoy a smooth, intuitive interface designed for both beginners and pros. Make your selfies flawless with skin smoothing and beauty enhancements. Correct perspective and lens distortions with precision tools. Turn your photos into artistic masterpieces using advanced AI filters. PhotoTune Pro is your all-in-one solution for editing, enhancing, and sharing stunning images every day.",
    "size": 60,
    "reviews": 8800,
    "ratingAvg": 4.4,
    "downloads": 2000000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 4400 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/XbyPYUvaiayhseYJkxprcSRwnRCm3wtlEQq9SW7eQ-aCaYCbqi3NSweLJgzK_i1u2EY=w480-h960-rw",
    "title": "FitTrack",
    "companyName": "Healthify Co.",
    "id": 3,
    "description": "FitTrack is your all-in-one fitness and health companion that helps you track workouts, monitor progress, and achieve your fitness goals. Log exercises, track steps, and measure calories burned with ease. Set personalized workout plans and stay motivated with daily reminders. Monitor your heart rate, sleep patterns, and overall wellness for a complete health overview. Track your weight, body measurements, and BMI to see your progress over time. Explore guided workouts, challenges, and expert tips to level up your fitness journey. Stay accountable with progress charts, detailed stats, and goal tracking features. Connect with friends and share achievements to keep your fitness journey social and fun. Receive nutrition insights and healthy meal suggestions tailored to your goals. FitTrack helps you stay consistent, motivated, and in control of your health. Access detailed exercise tutorials and form guides to maximize results. Customize your fitness experience with different modes and difficulty levels. Track cardio, strength, flexibility, and more for a balanced fitness routine. Celebrate milestones and stay inspired with badges and rewards. FitTrack is your smart partner for a healthier, stronger, and more active lifestyle every day."
,
    "size": 38,
    "reviews": 6700,
    "ratingAvg": 4.3,
    "downloads": 1500000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 450 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 2900 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/CmrS33pOxRYpZhx_nnwQeNat8oE8rLx5tQfNn4KQjmJiqjDuReg-qKISVqutoGrKmAs=w480-h960-rw",
    "title": "Noteify",
    "companyName": "BrainSync",
    "id": 4,
    "description": "Noteify is your ultimate note-taking and organization app designed to keep your ideas, tasks, and reminders in one place. Quickly capture thoughts, to-dos, and important information with a simple and intuitive interface. Organize notes into folders, tags, and categories for easy access. Add checklists, bullet points, and numbered lists to stay productive and structured. Highlight key points, attach images, voice memos, and files to enrich your notes. Search and filter notes instantly to find what you need in seconds. Set reminders and notifications to never forget important tasks or deadlines. Sync your notes across devices so you can access them anytime, anywhere. Customize themes, fonts, and layouts to match your style and workflow. Collaborate with friends, classmates, or colleagues by sharing notes and projects seamlessly. Secure your notes with password protection or biometric authentication for privacy. Export notes as PDF or text files to save or share easily. Noteify makes note-taking, planning, and productivity effortless and enjoyable. Stay organized, focused, and on top of your tasks with ease. Transform your ideas into actionable plans and keep your life organized with Noteify every day."
,
    "size": 25,
    "reviews": 5400,
    "ratingAvg": 4.5,
    "downloads": 1200000,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 1600 },
      { "name": "5 star", "count": 2600 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/SnojGEhGpKn8IR1llHmRysc7QDpef10h41WBgavh_hDZsxpxwwKWJdzNMcoY85yZPJg=w480-h960-rw",
    "title": "GameBoost",
    "companyName": "GamerX",
    "id": 5,
    "description": "Noteify is your ultimate note-taking and organization app designed to help you capture ideas, plan tasks, and stay productive. Quickly jot down notes, create checklists, and organize your thoughts with ease. Categorize notes with folders, tags, and colors for faster access and better organization. Add images, voice recordings, and attachments to make your notes more informative and interactive. Set reminders and deadlines to stay on top of your tasks and never miss an important event. Sync your notes across all devices to access them anytime, anywhere. Enjoy a clean, intuitive interface that makes note-taking smooth and efficient. Collaborate with friends, classmates, or colleagues by sharing notes and working together in real-time. Search and find notes instantly with powerful search and filtering options. Protect your notes with passwords or biometric security for peace of mind. Customize your notes with fonts, styles, and themes to suit your preferences. Capture ideas quickly with widgets and quick-add features. Track your productivity and review your progress over time. Noteify is perfect for students, professionals, and anyone who wants to stay organized and efficient. Transform your ideas into actionable plans and stay on top of your life with Noteify every day."
,
    "size": 50,
    "reviews": 9800,
    "ratingAvg": 4.2,
    "downloads": 3000000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 4400 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/gmN7w6h4vr8C-Z0hsomy_5kWguSnxqshI-eT8VhjJzzbfbn22OSvRWuo2ZtinyA0IdA=w480-h960-rw",
    "title": "MusicMate",
    "companyName": "TuneCraft",
    "id": 6,
    "description": "MusicMate is your ultimate music companion, designed to let you discover, stream, and enjoy your favorite songs anytime, anywhere. Explore millions of tracks across all genres and create personalized playlists to match your mood. Discover new artists, trending hits, and curated recommendations tailored just for you. Stream high-quality audio seamlessly and enjoy offline playback by downloading your favorite songs. Share playlists and favorite tracks with friends and connect with the global music community. Customize your listening experience with equalizers, themes, and smart suggestions. Set sleep timers, create workout playlists, and enjoy continuous music without interruptions. MusicMate lets you follow artists, stay updated on new releases, and explore exclusive content. Search, organize, and manage your music library effortlessly with an intuitive interface. Experience smooth, fast, and responsive playback for hours of uninterrupted enjoyment. MusicMate is perfect for music lovers, audiophiles, and anyone who wants to make every moment more musical. Discover, listen, and share the joy of music with MusicMate every day."
,
    "size": 70,
    "reviews": 24000,
    "ratingAvg": 4.8,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 5500 },
      { "name": "5 star", "count": 14400 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/V6TNNxaP4yNxgL1LqT2WM0hcnM7yDvQUCfZu7mMWw_u-Fi6FF2sF41RV_PvpP9iXXg=w480-h960-rw",
    "title": "CodeRunner",
    "companyName": "DevPro",
    "id": 7,
    "description": "CodeRunner is a powerful coding and development app designed to help programmers write, test, and debug code on the go. Support for multiple programming languages allows you to code anywhere, anytime. Write scripts, algorithms, and projects with an intuitive and clean interface that boosts productivity. Run and test your code instantly with a built-in compiler and real-time output. Organize projects, save snippets, and manage files efficiently for seamless development. Customize your coding environment with themes, fonts, and keyboard shortcuts to suit your workflow. Collaborate with other developers, share code snippets, and learn from community examples. Access tutorials, documentation, and coding challenges to enhance your skills. CodeRunner helps beginners learn programming and professionals code faster and smarter. Debug errors with step-by-step guidance and see results immediately. Sync projects across devices to keep your work updated everywhere. Track progress, manage multiple projects, and stay productive with ease. CodeRunner is your all-in-one companion for coding, learning, and building software anytime, anywhere."
,
    "size": 40,
    "reviews": 4300,
    "ratingAvg": 4.7,
    "downloads": 950000,
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 450 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 2300 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/1iGAt3T5hKVgv2fbeCHoLiz4yzZYdxIdfDcpzoEyeNp7QFvqF13JsGQpI6SIVj3TbMc=w480-h960-rw",
    "title": "WeatherGo",
    "companyName": "SkyNet Solutions",
    "id": 8,
    "description": "WeatherGo is your all-in-one weather app that provides accurate, real-time forecasts and helps you plan your day with confidence. Get hourly, daily, and weekly weather updates with detailed information on temperature, humidity, wind speed, and precipitation. Receive severe weather alerts and notifications to stay safe during storms, rain, or extreme conditions. Explore interactive maps for radar, satellite, and weather patterns around your location or anywhere in the world. Customize your dashboard with widgets, themes, and locations for quick access to the weather you care about. Track UV index, air quality, sunrise and sunset times, and more for a complete weather overview. WeatherGo helps you plan outdoor activities, travel, and daily routines with accurate predictions. Stay informed with live weather news, alerts, and tips for every season. Easily switch between Celsius and Fahrenheit, and explore multiple locations at a glance. WeatherGo is perfect for commuters, travelers, outdoor enthusiasts, and anyone who wants reliable weather information anytime, anywhere."
,
    "size": 32,
    "reviews": 7100,
    "ratingAvg": 4.1,
    "downloads": 2400000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 2700 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/4pgpFPvl7ehJLp-JDAP8yG0UqeKGO1tisifMisWpcvLdURt383NLz_QO8PMZ_RaDGvTb=w480-h960-rw",
    "title": "LearnHub",
    "companyName": "EduSmart",
    "id": 9,
    "description": "LearnHub is your all-in-one learning platform designed to help you gain knowledge, develop new skills, and achieve your educational goals. Access a wide range of courses, tutorials, and interactive lessons across subjects like programming, design, business, and more. Learn at your own pace with video lectures, quizzes, and hands-on exercises to reinforce your understanding. Track your progress, earn certificates, and showcase your achievements to boost your career or academic profile. Connect with expert instructors and a global community of learners for guidance and support. Stay motivated with personalized recommendations, learning paths, and daily challenges. Download lessons for offline access and continue learning anytime, anywhere. Explore real-world projects, case studies, and practical exercises to apply your knowledge effectively. Improve your skills with continuous assessments, practice tests, and performance analytics. LearnHub is perfect for students, professionals, and lifelong learners who want to grow, upskill, and stay ahead in their personal and professional journey. Transform your learning experience and unlock your potential with LearnHub every day."
,
    "size": 55,
    "reviews": 13200,
    "ratingAvg": 4.6,
    "downloads": 4500000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1300 },
      { "name": "4 star", "count": 3200 },
      { "name": "5 star", "count": 7600 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/EZsU0nYwrGFHTz5lZ21jFR8OqImYKm8NBBsMRlRKU8OOwEQKhcFcwc5G3Y8ktAokIH4=w480-h960-rw",
    "title": "FinanceFlow",
    "companyName": "MoneyPro",
    "id": 10,
    "description": "FinanceFlow is your all-in-one personal finance and budgeting app designed to help you manage money smarter, save more, and achieve your financial goals. Track income, expenses, and bills with ease, and gain a clear overview of your financial health. Create budgets, set spending limits, and monitor your progress in real-time. Get insights and reports that help you make informed decisions and optimize your savings. Receive reminders for bills, upcoming payments, and subscription renewals to stay on top of your finances. Analyze spending patterns, categorize expenses, and identify areas to cut costs. Set financial goals, track milestones, and celebrate achievements as you reach them. Sync securely across devices to access your data anytime, anywhere. Stay on top of investments, track net worth, and manage multiple accounts effortlessly. FinanceFlow combines powerful analytics with a clean, intuitive interface for stress-free money management. Take control of your finances, plan for the future, and make smarter financial decisions every day with FinanceFlow."
,
    "size": 30,
    "reviews": 9700,
    "ratingAvg": 4.5,
    "downloads": 2800000,
    "ratings": [
      { "name": "1 star", "count": 350 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 5350 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/qzd5vlydFBIqYusKaQbrHSBsXPM4yi5kHuuspRPu-fTyw7bFwvthksMiSEGY1cUcJuw=w480-h960-rw",
    "title": "TravelBuddy",
    "companyName": "TripVerse",
    "id": 11,
    "description": "TravelBuddy is your ultimate travel companion, designed to make every journey effortless, enjoyable, and memorable. Discover destinations, plan trips, and organize itineraries all in one place. Find the best flights, hotels, and local experiences with real-time recommendations and deals. Explore attractions, restaurants, and hidden gems to make your travel unique and personalized. Get offline maps, navigation, and travel guides to stay on track wherever you go. Track your travel expenses, create packing lists, and manage bookings seamlessly. Connect with other travelers, share experiences, and get tips from a global community. Receive personalized travel suggestions based on your preferences and past trips. Stay informed with weather updates, local events, and safety alerts. Save favorite destinations, plan future trips, and revisit memories with TravelBuddy’s organized travel journal. Whether traveling solo, with friends, or family, TravelBuddy ensures a smooth, enjoyable, and unforgettable travel experience every day."
,
    "size": 48,
    "reviews": 8500,
    "ratingAvg": 4.4,
    "downloads": 3700000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 3800 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/BqVRH_uCWl9M1yGseY-vkN3GL7uioqL8wOmfa-nPwk5BTZK_q5v3lduMt2pWyjBSkT1B3qjV27UrOaw98413=w480-h960-rw",
    "title": "MindEase",
    "companyName": "CalmWave",
    "id": 12,
    "description": "MindEase is your personal mental wellness companion, designed to help you reduce stress, improve focus, and achieve inner calm. Explore guided meditations, breathing exercises, and mindfulness practices tailored to your needs. Track your mood, set daily intentions, and build healthy mental habits over time. Access sleep stories, relaxation music, and calming sounds to improve sleep quality and promote deep rest. Learn stress management techniques and coping strategies to navigate everyday challenges with ease. Receive reminders and gentle notifications to stay consistent with your mental wellness routine. MindEase provides expert-backed tips, exercises, and insights to enhance emotional well-being. Customize your experience with meditation lengths, themes, and focus areas to fit your lifestyle. Connect with a supportive community, share progress, and stay motivated on your wellness journey. MindEase is perfect for anyone looking to improve mindfulness, reduce anxiety, and cultivate a happier, healthier mind every day."
,
    "size": 42,
    "reviews": 9100,
    "ratingAvg": 4.7,
    "downloads": 4000000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 6050 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/fXkCDDweRhUM5rOJ8z1jFRstUisQJNLubPNFYldI0YEbS_gBM3RVvqvXoDvD0eZ1FQ=w480-h960-rw",
    "title": "QuickScan",
    "companyName": "Docify",
    "id": 13,
    "description": "QuickScan is your fast and reliable scanning app, designed to turn your device into a portable scanner anytime, anywhere. Scan documents, receipts, photos, and notes quickly with high-quality results. Convert scans into PDF or image formats for easy sharing and storage. Crop, rotate, and enhance scanned images automatically for clear, professional-looking documents. Organize scans into folders, tag them, and search effortlessly to find what you need instantly. Use OCR (Optical Character Recognition) to extract text from scanned documents and make them editable. Share scanned files via email, cloud services, or messaging apps with ease. Protect sensitive documents with password or biometric security for privacy. Batch scan multiple pages and combine them into a single PDF seamlessly. QuickScan is perfect for students, professionals, and anyone who wants to digitize documents quickly and efficiently. Simplify your workflow, reduce paper clutter, and manage documents on the go with QuickScan every day."
,
    "size": 28,
    "reviews": 5800,
    "ratingAvg": 4.2,
    "downloads": 1900000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 450 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 2450 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/CH_XUrL7OA4E49kFjcnZyzhVWuOEuBCZ1mfUZxY8ey8AyGnIBSuprVM3rKeVdcbllw=w480-h960-rw",
    "title": "CryptoTrack",
    "companyName": "BlockWave",
    "id": 14,
    "description": "QuickScan is your fast and reliable scanning app, designed to turn your device into a portable scanner anytime, anywhere. Scan documents, receipts, photos, and notes quickly with high-quality results. Convert scans into PDF or image formats for easy sharing and storage. Crop, rotate, and enhance scanned images automatically for clear, professional-looking documents. Organize scans into folders, tag them, and search effortlessly to find what you need instantly. Use OCR (Optical Character Recognition) to extract text from scanned documents and make them editable. Share scanned files via email, cloud services, or messaging apps with ease. Protect sensitive documents with password or biometric security for privacy. Batch scan multiple pages and combine them into a single PDF seamlessly. QuickScan is perfect for students, professionals, and anyone who wants to digitize documents quickly and efficiently. Simplify your workflow, reduce paper clutter, and manage documents on the go with QuickScan every day."
,
    "size": 49,
    "reviews": 10400,
    "ratingAvg": 4.3,
    "downloads": 3200000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 5300 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/ITUxxrfNi_zwVCB-j7znK4hkCT2-7xExx_0CnSfAvM0k2tJyDPnwYdTxVzon2CFfKw=w480-h960-rw",
    "title": "StoryPix",
    "companyName": "InspireLab",
    "id": 15,
    "description": "StoryPix is your ultimate storytelling and photo editing app, designed to help you create stunning visual stories and share them effortlessly. Combine photos, videos, and music to craft engaging stories that capture attention. Add text, stickers, filters, and effects to make your content unique and expressive. Explore creative templates and layouts for quick, professional-looking results. Adjust colors, brightness, contrast, and saturation to enhance every detail. Share your stories directly on social media platforms or save them for later use. Organize your projects, manage media, and revisit past creations anytime. Use animation and transitions to bring your stories to life. StoryPix is perfect for influencers, content creators, students, and anyone who wants to tell their story visually. Unlock your creativity, inspire your audience, and make every moment memorable with StoryPix every day."
,
    "size": 54,
    "reviews": 15000,
    "ratingAvg": 4.8,
    "downloads": 8000000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1300 },
      { "name": "4 star", "count": 3200 },
      { "name": "5 star", "count": 11000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/zpO2TM18Hbr5_sUxLlV5GqxpPtGEhDLN1XOokiTf7AVB8X1-3olfCGmsHc2qmisWbzg=w480-h960-rw",
    "title": "BookNest",
    "companyName": "ReadMore",
    "id": 16,
    "description": "BookNest is your all-in-one reading and book management app, designed to help book lovers discover, organize, and enjoy their favorite reads. Explore thousands of books across genres, authors, and languages to find your next great read. Create personalized reading lists, track your progress, and set reading goals to stay motivated. Add notes, highlights, and bookmarks to remember important insights and favorite passages. Get recommendations based on your interests and reading history to discover new favorites. Connect with a global community of readers, share reviews, and discuss books with friends. Sync your library across devices for seamless access anytime, anywhere. Keep track of your owned books, wishlists, and completed reads in one organized place. Explore curated collections, trending books, and top charts to stay updated on popular titles. BookNest is perfect for students, avid readers, and lifelong learners who want to organize, discover, and enjoy reading every day."
,
    "size": 62,
    "reviews": 11200,
    "ratingAvg": 4.5,
    "downloads": 4200000,
    "ratings": [
      { "name": "1 star", "count": 350 },
      { "name": "2 star", "count": 450 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2700 },
      { "name": "5 star", "count": 6800 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/8h-vibuWccUfYDXsoP1M3Z7XHQlxCuMV-OvAEepcnYXSUUOETgdfcnBCSbCjLJ4iTwmY=w480-h960-rw",
    "title": "TaskHero",
    "companyName": "FocusWorks",
    "id": 17,
    "description": "TaskHero is your ultimate productivity and task management app, designed to help you organize, prioritize, and complete your tasks efficiently. Create to-do lists, set deadlines, and track progress to stay on top of your daily goals. Organize tasks with categories, tags, and priorities for better focus and clarity. Set reminders and notifications to never miss important deadlines or appointments. Break large projects into smaller steps and track each milestone with ease. Collaborate with friends, colleagues, or team members by sharing tasks and projects. Visualize your progress with charts, calendars, and productivity insights. Customize your workspace with themes, layouts, and personal preferences for a tailored experience. Sync tasks across all devices to access your work anytime, anywhere. TaskHero helps you stay focused, motivated, and organized, turning your goals into achievements every day."
,
    "size": 33,
    "reviews": 6300,
    "ratingAvg": 4.4,
    "downloads": 1800000,
    "ratings": [
      { "name": "1 star", "count": 220 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 850 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 2830 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/K34bVwiqTpH-Q0UUhGsBXG561na1K7fdjlosPvluNwuFnyUoovMHod6G4i-XTgz9Og=w480-h960-rw",
    "title": "VidMateX",
    "companyName": "MediaPro",
    "id": 18,
    "description": "VidMateX is your ultimate video downloader and streaming companion, designed to help you discover, download, and enjoy videos effortlessly. Stream videos from multiple platforms in high quality and save them for offline viewing anytime, anywhere. Download videos in various formats and resolutions to suit your device and preferences. Create personalized playlists and organize your favorite content for easy access. Explore trending videos, recommended content, and new releases tailored to your interests. Share videos with friends and family quickly and easily. Enjoy a smooth, fast, and ad-free experience with an intuitive interface. Manage downloads efficiently and resume interrupted downloads seamlessly. VidMateX is perfect for entertainment lovers who want to watch, save, and share videos conveniently and reliably every day."
,
    "size": 66,
    "reviews": 22000,
    "ratingAvg": 4.7,
    "downloads": 9000000,
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 1700 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 13600 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/zzke1cwoN3fEAcfNmrtHBCNboOxz8sUPy3_dIgGxhF_dbreEqnhPcQ-6cNo_lRQJog0=w480-h960-rw",
    "title": "SmartTranslate",
    "companyName": "LangBridge",
    "id": 19,
    "description": "SmartTranslate is your powerful language translation and communication app, designed to help you break language barriers and connect with the world. Translate text, speech, and images instantly across multiple languages with high accuracy. Communicate effortlessly in real-time with friends, colleagues, or travelers using voice and text translations. Save and organize your favorite phrases for quick access, and use offline mode to translate without internet. Learn new words and improve your language skills with integrated pronunciation guides and examples. Share translations easily via messaging apps or social media. Explore multilingual dictionaries, phrasebooks, and contextual suggestions to enhance understanding. SmartTranslate is perfect for travelers, students, professionals, and anyone who wants to communicate globally with ease. Make language learning, translation, and cross-cultural communication simple, fast, and accurate with SmartTranslate every day."
,
    "size": 58,
    "reviews": 19500,
    "ratingAvg": 4.6,
    "downloads": 7000000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 10600 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/vlqOAqb_ukYcMLL4VxgL-xjtudc71g8L8Izm4Gzk-WGb4Aw3QTHPNx1G7BJopwliWA=w480-h960-rw",
    "title": "SleepSync",
    "companyName": "DreamTech",
    "id": 20,
    "description": "SleepSync is your ultimate sleep and relaxation companion, designed to help you improve sleep quality, reduce stress, and wake up refreshed. Track your sleep patterns, monitor sleep cycles, and get personalized insights to optimize rest. Explore guided meditations, relaxing sounds, and sleep stories to fall asleep faster and stay in deep sleep longer. Set smart alarms that wake you gently at the optimal time in your sleep cycle. Learn healthy bedtime routines, breathing exercises, and mindfulness techniques to enhance sleep quality. Monitor daily habits and lifestyle factors that affect your rest, and receive actionable tips for better sleep. Customize sounds, timers, and schedules to suit your preferences. SleepSync is perfect for anyone looking to improve sleep, reduce insomnia, and wake up energized. Achieve restorative rest and improve overall well-being with SleepSync every day."
,
    "size": 37,
    "reviews": 5600,
    "ratingAvg": 4.3,
    "downloads": 1600000,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 2600 }
    ]
  }
]
