[
  {
    "image": "https://play-lh.googleusercontent.com/BbfjA9RAs9RjqdhhICjFTh-AKQl04ZalcDqmlMXLCRJOtiufp_-0JI1Ah3astkABkQM=w480-h960-rw",
    "title": "ChatMaster AI",
    "companyName": "TechNova Labs",
    "id": 1,
    "description": "ChatMaster AI — your ultimate AI assistant for smart conversations anytime, anywhere. Get instant answers, write better, and learn faster with ChatMaster AI’s advanced intelligence. Powered by next-gen AI — ChatMaster AI helps you think, create, and solve problems easily. Write essays, captions, stories, or emails in seconds — ChatMaster AI does it all. Boost your productivity with quick, accurate, and human-like responses. ChatMaster AI speaks your language — literally! Chat fluently in multiple languages. Perfect for students, creators, and professionals — your all-in-one AI companion. Ask anything — ChatMaster AI is always ready with helpful, creative, or funny answers. Learn new skills, explore ideas, and expand your knowledge through smart chats. Simplify your daily life with AI-powered writing, learning, and planning tools. Get summaries of books, notes for study, or explanations for complex topics in seconds. Create content, generate quotes, or craft social media posts effortlessly. Experience smooth, natural conversations powered by intelligent technology. Your data stays private — ChatMaster AI values your trust and security. A lightweight, fast, and beautiful app designed for your comfort. Chat smarter, work faster, and think bigger — with ChatMaster AI. Discover the power of conversation-driven intelligence with ChatMaster AI. Turn ideas into actions instantly using the creativity of ChatMaster AI. Master communication, productivity, and learning with one powerful AI. ChatMaster AI — the smartest way to chat, create, and grow every day.",
    "size": 45,
    "reviews": 12500,
    "ratingAvg": 4.6,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 450 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 950 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 8700 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/Yu8NSIupn1KINmCM8ublKONAg7dnhU1FN2I2D61z4tnznql9vz9lXmG0eh43un6eAg=w480-h960-rw",
    "title": "PhotoTune Pro",
    "companyName": "PixArt Studio",
    "id": 2,
    "description": "PhotoTune Pro is the ultimate photo editing app that brings your images to life with professional-quality tools. Enhance your photos with easy-to-use filters, adjust brightness, contrast, and saturation to perfection. Apply artistic effects, overlays, and textures to make your images stand out. Crop, rotate, and resize images effortlessly to fit any platform. Remove unwanted objects or blemishes with intelligent editing features. Create stunning collages and combine multiple photos creatively. Add text, stickers, and emojis to personalize your pictures. Adjust colors, tones, and highlights for a cinematic look. Use advanced AI tools to automatically enhance portraits and landscapes. Sharpen details and reduce noise for crystal-clear images. Save your edits in high resolution and share instantly on social media. Explore creative templates and professional presets for quick edits. Transform ordinary photos into works of art with just a few taps. Easily manage your photo library and keep your projects organized. Enjoy a smooth, intuitive interface designed for both beginners and pros. Make your selfies flawless with skin smoothing and beauty enhancements. Correct perspective and lens distortions with precision tools. Turn your photos into artistic masterpieces using advanced AI filters. PhotoTune Pro is your all-in-one solution for editing, enhancing, and sharing stunning images every day.",
    "size": 60,
    "reviews": 8800,
    "ratingAvg": 4.4,
    "downloads": 2000000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 4400 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/XbyPYUvaiayhseYJkxprcSRwnRCm3wtlEQq9SW7eQ-aCaYCbqi3NSweLJgzK_i1u2EY=w480-h960-rw",
    "title": "FitTrack",
    "companyName": "Healthify Co.",
    "id": 3,
    "description": "FitTrack is your all-in-one fitness and health companion that helps you track workouts, monitor progress, and achieve your fitness goals. Log exercises, track steps, and measure calories burned with ease. Set personalized workout plans and stay motivated with daily reminders. Monitor your heart rate, sleep patterns, and overall wellness for a complete health overview. Track your weight, body measurements, and BMI to see your progress over time. Explore guided workouts, challenges, and expert tips to level up your fitness journey. Stay accountable with progress charts, detailed stats, and goal tracking features. Connect with friends and share achievements to keep your fitness journey social and fun. Receive nutrition insights and healthy meal suggestions tailored to your goals. FitTrack helps you stay consistent, motivated, and in control of your health. Access detailed exercise tutorials and form guides to maximize results. Customize your fitness experience with different modes and difficulty levels. Track cardio, strength, flexibility, and more for a balanced fitness routine. Celebrate milestones and stay inspired with badges and rewards. FitTrack is your smart partner for a healthier, stronger, and more active lifestyle every day.",
    "size": 38,
    "reviews": 6700,
    "ratingAvg": 4.3,
    "downloads": 1500000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 450 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 2900 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/CmrS33pOxRYpZhx_nnwQeNat8oE8rLx5tQfNn4KQjmJiqjDuReg-qKISVqutoGrKmAs=w480-h960-rw",
    "title": "Noteify",
    "companyName": "BrainSync",
    "id": 4,
    "description": "Noteify is your ultimate note-taking and organization app designed to keep your ideas, tasks, and reminders in one place. Quickly capture thoughts, to-dos, and important information with a simple and intuitive interface. Organize notes into folders, tags, and categories for easy access. Add checklists, bullet points, and numbered lists to stay productive and structured. Highlight key points, attach images, voice memos, and files to enrich your notes. Search and filter notes instantly to find what you need in seconds. Set reminders and notifications to never forget important tasks or deadlines. Sync your notes across devices so you can access them anytime, anywhere. Customize themes, fonts, and layouts to match your style and workflow. Collaborate with friends, classmates, or colleagues by sharing notes and projects seamlessly. Secure your notes with password protection or biometric authentication for privacy. Export notes as PDF or text files to save or share easily. Noteify makes note-taking, planning, and productivity effortless and enjoyable. Stay organized, focused, and on top of your tasks with ease. Transform your ideas into actionable plans and keep your life organized with Noteify every day.",
    "size": 25,
    "reviews": 5400,
    "ratingAvg": 4.5,
    "downloads": 1200000,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 1600 },
      { "name": "5 star", "count": 2600 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/SnojGEhGpKn8IR1llHmRysc7QDpef10h41WBgavh_hDZsxpxwwKWJdzNMcoY85yZPJg=w480-h960-rw",
    "title": "GameBoost",
    "companyName": "GamerX",
    "id": 5,
    "description": "Noteify is your ultimate note-taking and organization app designed to help you capture ideas, plan tasks, and stay productive. Quickly jot down notes, create checklists, and organize your thoughts with ease. Categorize notes with folders, tags, and colors for faster access and better organization. Add images, voice recordings, and attachments to make your notes more informative and interactive. Set reminders and deadlines to stay on top of your tasks and never miss an important event. Sync your notes across all devices to access them anytime, anywhere. Enjoy a clean, intuitive interface that makes note-taking smooth and efficient. Collaborate with friends, classmates, or colleagues by sharing notes and working together in real-time. Search and find notes instantly with powerful search and filtering options. Protect your notes with passwords or biometric security for peace of mind. Customize your notes with fonts, styles, and themes to suit your preferences. Capture ideas quickly with widgets and quick-add features. Track your productivity and review your progress over time. Noteify is perfect for students, professionals, and anyone who wants to stay organized and efficient. Transform your ideas into actionable plans and stay on top of your life with Noteify every day.",
    "size": 50,
    "reviews": 9800,
    "ratingAvg": 4.2,
    "downloads": 3000000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 4400 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/gmN7w6h4vr8C-Z0hsomy_5kWguSnxqshI-eT8VhjJzzbfbn22OSvRWuo2ZtinyA0IdA=w480-h960-rw",
    "title": "MusicMate",
    "companyName": "TuneCraft",
    "id": 6,
    "description": "MusicMate is your ultimate music companion, designed to let you discover, stream, and enjoy your favorite songs anytime, anywhere. Explore millions of tracks across all genres and create personalized playlists to match your mood. Discover new artists, trending hits, and curated recommendations tailored just for you. Stream high-quality audio seamlessly and enjoy offline playback by downloading your favorite songs. Share playlists and favorite tracks with friends and connect with the global music community. Customize your listening experience with equalizers, themes, and smart suggestions. Set sleep timers, create workout playlists, and enjoy continuous music without interruptions. MusicMate lets you follow artists, stay updated on new releases, and explore exclusive content. Search, organize, and manage your music library effortlessly with an intuitive interface. Experience smooth, fast, and responsive playback for hours of uninterrupted enjoyment. MusicMate is perfect for music lovers, audiophiles, and anyone who wants to make every moment more musical. Discover, listen, and share the joy of music with MusicMate every day.",
    "size": 70,
    "reviews": 24000,
    "ratingAvg": 4.8,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 5500 },
      { "name": "5 star", "count": 14400 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/V6TNNxaP4yNxgL1LqT2WM0hcnM7yDvQUCfZu7mMWw_u-Fi6FF2sF41RV_PvpP9iXXg=w480-h960-rw",
    "title": "CodeRunner",
    "companyName": "DevPro",
    "id": 7,
    "description": "CodeRunner is a powerful coding and development app designed to help programmers write, test, and debug code on the go. Support for multiple programming languages allows you to code anywhere, anytime. Write scripts, algorithms, and projects with an intuitive and clean interface that boosts productivity. Run and test your code instantly with a built-in compiler and real-time output. Organize projects, save snippets, and manage files efficiently for seamless development. Customize your coding environment with themes, fonts, and keyboard shortcuts to suit your workflow. Collaborate with other developers, share code snippets, and learn from community examples. Access tutorials, documentation, and coding challenges to enhance your skills. CodeRunner helps beginners learn programming and professionals code faster and smarter. Debug errors with step-by-step guidance and see results immediately. Sync projects across devices to keep your work updated everywhere. Track progress, manage multiple projects, and stay productive with ease. CodeRunner is your all-in-one companion for coding, learning, and building software anytime, anywhere.",
    "size": 40,
    "reviews": 4300,
    "ratingAvg": 4.7,
    "downloads": 950000,
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 450 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 2300 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/1iGAt3T5hKVgv2fbeCHoLiz4yzZYdxIdfDcpzoEyeNp7QFvqF13JsGQpI6SIVj3TbMc=w480-h960-rw",
    "title": "WeatherGo",
    "companyName": "SkyNet Solutions",
    "id": 8,
    "description": "WeatherGo is your all-in-one weather app that provides accurate, real-time forecasts and helps you plan your day with confidence. Get hourly, daily, and weekly weather updates with detailed information on temperature, humidity, wind speed, and precipitation. Receive severe weather alerts and notifications to stay safe during storms, rain, or extreme conditions. Explore interactive maps for radar, satellite, and weather patterns around your location or anywhere in the world. Customize your dashboard with widgets, themes, and locations for quick access to the weather you care about. Track UV index, air quality, sunrise and sunset times, and more for a complete weather overview. WeatherGo helps you plan outdoor activities, travel, and daily routines with accurate predictions. Stay informed with live weather news, alerts, and tips for every season. Easily switch between Celsius and Fahrenheit, and explore multiple locations at a glance. WeatherGo is perfect for commuters, travelers, outdoor enthusiasts, and anyone who wants reliable weather information anytime, anywhere.",
    "size": 32,
    "reviews": 7100,
    "ratingAvg": 4.1,
    "downloads": 2400000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 2700 }
    ]
  }
]
